---
kind: method
id: M:Autodesk.Revit.DB.ImageExportOptions.Dispose
source: html/514d82df-3b74-9696-fb98-1c4a8f3887cd.htm
---
# Autodesk.Revit.DB.ImageExportOptions.Dispose Method

Releases all resources used by the ImageExportOptions

## Syntax (C#)
```csharp
public void Dispose()
```